# Rotation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNoteOptions..::..Rotation Property
TextNoteOptions Class See Also
---
Base line angle of a text note, in radians.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double Rotation { get; set; }
```

Visual Basic
---
```text
Public Property Rotation As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Rotation {
	double get ();
	void set (double value);
}
```

# Remarks
Default value is 0.0.
# See Also
TextNoteOptions Class
Autodesk.Revit.DB Namespace